### Terraform Plan 📋
**Environment:** `dev`
**Result:** `failure`

<details><summary>Show Plan</summary>

```terraform
module.alb_controller.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.alb_controller.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.aws_cloudwatch_log_group.eks: Refreshing state... [id=/aws/eks/eks-portfolio-Dev/cluster]
module.eks.aws_iam_role.eks_cluster: Refreshing state... [id=eks-portfolio-Dev-cluster-role]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-00fdd5dbc07fadc7a]
module.security.data.aws_caller_identity.current: Reading...
module.route53[0].data.aws_partition.current: Reading...
module.alb_controller.data.aws_partition.current: Read complete after 0s [id=aws]
module.route53[0].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_iam_role.eks_nodes: Refreshing state... [id=eks-portfolio-Dev-node-group-role]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]
module.eks.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks-portfolio-Dev-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller: Refreshing state... [id=eks-portfolio-Dev-cluster-role/arn:aws:iam::aws:policy/AmazonEKSVPCResourceController]
module.alb_controller.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]
module.eks.aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=eks-portfolio-Dev-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks.aws_iam_role_policy_attachment.eks_ssm_managed_instance: Refreshing state... [id=eks-portfolio-Dev-node-group-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.eks.aws_iam_role_policy_attachment.eks_container_registry_read: Refreshing state... [id=eks-portfolio-Dev-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks.aws_iam_role_policy_attachment.eks_cni_policy: Refreshing state... [id=eks-portfolio-Dev-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.security.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]
module.security.aws_kms_key.eks: Refreshing state... [id=f554454b-3713-4be4-b7fb-60ffeb0e16a7]
module.security.aws_kms_key.ebs: Refreshing state... [id=abb6e5cc-cc0c-4191-b787-855a1e2f5af5]
module.security.aws_kms_alias.eks: Refreshing state... [id=alias/eks-portfolio-Dev-eks]
module.security.aws_kms_alias.ebs: Refreshing state... [id=alias/eks-portfolio-Dev-ebs]
module.eks.aws_launch_template.eks_nodes: Refreshing state... [id=lt-0ef08bec12eb88e7e]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-05755150a4efc78e5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0feacd291606e0ffe]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05d37fe7b45d51b8b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0499b3bb3fd04b04b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03272d552cdfe84b8]
module.security.aws_security_group.eks_cluster: Refreshing state... [id=sg-0ecf3a71ba48ecd47]
module.security.aws_security_group.eks_nodes: Refreshing state... [id=sg-07d848a4ebd45ac67]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00eec41cf20b08ee6]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-00dc6acb760976699]
module.security.aws_vpc_security_group_egress_rule.eks_cluster_all: Refreshing state... [id=sgr-09a99116ddbc44eff]
module.security.aws_vpc_security_group_egress_rule.eks_nodes_all: Refreshing state... [id=sgr-0f4f93db46e1278ce]
module.eks.aws_eks_cluster.this: Refreshing state... [id=eks-portfolio-Dev]
module.security.aws_vpc_security_group_ingress_rule.eks_nodes_self: Refreshing state... [id=sgr-0546a89cffe259330]
module.security.aws_vpc_security_group_ingress_rule.eks_nodes_cluster_https: Refreshing state... [id=sgr-05774107adbe064aa]
module.security.aws_vpc_security_group_ingress_rule.eks_nodes_cluster: Refreshing state... [id=sgr-0534fd7ea6a048407]
module.security.aws_vpc_security_group_ingress_rule.eks_cluster_https: Refreshing state... [id=sgr-0a475a0db72687626]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ec4fda7421cb37dc]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dad2ddd0425d7585]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e76989b99b5a41f6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-027fef7f7898d6f6f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f4f072cf923f2bc1]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05896df02d0766a80]
module.alb_controller.aws_iam_policy.alb_controller: Refreshing state... [id=arn:aws:iam::992382750905:policy/eks-portfolio-Dev-alb-controller-policy]
module.eks.aws_eks_node_group.this: Refreshing state... [id=eks-portfolio-Dev:eks-portfolio-Dev-default]
module.eks.data.tls_certificate.eks: Reading...
module.eks.aws_eks_access_entry.additional_admins["arn:aws:iam::992382750905:user/KostasAdmin"]: Refreshing state... [id=eks-portfolio-Dev:arn:aws:iam::992382750905:user/KostasAdmin]
module.eks.data.tls_certificate.eks: Read complete after 0s [id=13102e0a8585014b9cde9ab0c4895b6972be2a09]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::992382750905:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/8AEB7D342D3BAD1E64F87ED8E7B04607]
module.eks.aws_iam_role.cluster_autoscaler[0]: Refreshing state... [id=eks-portfolio-Dev-cluster-autoscaler]
module.alb_controller.aws_iam_role.alb_controller: Refreshing state... [id=eks-portfolio-Dev-alb-controller-role]
module.eks.aws_eks_access_policy_association.additional_admins["arn:aws:iam::992382750905:user/KostasAdmin"]: Refreshing state... [id=eks-portfolio-Dev#arn:aws:iam::992382750905:user/KostasAdmin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.alb_controller.aws_iam_role_policy_attachment.alb_controller: Refreshing state... [id=eks-portfolio-Dev-alb-controller-role/arn:aws:iam::992382750905:policy/eks-portfolio-Dev-alb-controller-policy]
module.eks.aws_iam_role_policy.cluster_autoscaler[0]: Refreshing state... [id=eks-portfolio-Dev-cluster-autoscaler:eks-portfolio-Dev-cluster-autoscaler-policy]
module.alb_controller.helm_release.alb_controller: Refreshing state... [id=aws-load-balancer-controller]
helm_release.metrics_server: Refreshing state... [id=metrics-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.argocd[0].aws_eks_addon.argocd will be created
  + resource "aws_eks_addon" "argocd" {
      + addon_name                  = "argo-cd"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "eks-portfolio-Dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      + tags                        = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-argocd-addon"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                    = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-argocd-addon"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.argocd[0].kubernetes_namespace.argocd will be created
  + resource "kubernetes_namespace" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/name"    = "argocd"
              + "app.kubernetes.io/part-of" = "argocd"
            }
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.aws_eks_access_entry.admin will be created
  + resource "aws_eks_access_entry" "admin" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-portfolio-Dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:sts::992382750905:assumed-role/github-actions-eks-project/GitHubActions"
      + region            = "eu-west-1"
      + tags              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all          = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.admin will be created
  + resource "aws_eks_access_policy_association" "admin" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-portfolio-Dev"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:sts::992382750905:assumed-role/github-actions-eks-project/GitHubActions"
      + region        = "eu-west-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.route53[0].aws_acm_certificate.wildcard[0] will be created
  + resource "aws_acm_certificate" "wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "condevelop.net"
      + domain_validation_options = [
          + {
              + domain_name           = "*.condevelop.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "condevelop.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + region                    = "eu-west-1"
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.condevelop.net",
          + "condevelop.net",
        ]
      + tags                      = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-wildcard-cert"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-wildcard-cert"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.route53[0].aws_acm_certificate_validation.wildcard[0] will be created
  + resource "aws_acm_certificate_validation" "wildcard" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + region                  = "eu-west-1"
      + validation_record_fqdns = (known after apply)
    }

  # module.route53[0].aws_iam_policy.external_dns will be created
  + resource "aws_iam_policy" "external_dns" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for ExternalDNS"
      + id               = (known after apply)
      + name             = "eks-portfolio-Dev-external-dns-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/Z01814392FEE2T297FHXM",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:ListResourceRecordSets",
                          + "route53:ListTagsForResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all         = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.route53[0].aws_iam_role.external_dns will be created
  + resource "aws_iam_role" "external_dns" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.eu-west-1.amazonaws.com/id/8AEB7D342D3BAD1E64F87ED8E7B04607:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-west-1.amazonaws.com/id/8AEB7D342D3BAD1E64F87ED8E7B04607:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::992382750905:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/8AEB7D342D3BAD1E64F87ED8E7B04607"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-external-dns-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.route53[0].aws_iam_role_policy_attachment.external_dns will be created
  + resource "aws_iam_role_policy_attachment" "external_dns" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-portfolio-Dev-external-dns-role"
    }

  # module.route53[0].aws_route53_record.cert_validation["*.condevelop.net"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z01814392FEE2T297FHXM"
    }

  # module.route53[0].aws_route53_record.cert_validation["condevelop.net"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z01814392FEE2T297FHXM"
    }

  # module.route53[0].helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.15.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "domainFilters[0]"
          + value = "condevelop.net"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[0].name"
          + value = "AWS_DEFAULT_REGION"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[0].value"
          + value = "eu-west-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "policy"
          + value = "sync"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "provider.name"
          + value = "aws"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "txtOwnerId"
          + value = "eks-portfolio-Dev"
            # (1 unchanged attribute hidden)
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ certificate_arn                    = "N/A - DNS resources not created" -> (known after apply)
  ~ external_dns_role_arn              = "N/A - DNS resources not created" -> (known after apply)
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @constantinious*